"use strict"

// ================== Домашня робота № 24 =====================

/*
Задача №1
Що потрапить в консоль?
*/
let someVar = 0;
++someVar;

if (someVar) {
	console.log(someVar);
}
/*
==== Відповідь: ====
в консоль потрапить цифра 1,
тому що інкремент ++ збільшить значення змінної someVar (0) на одиницю.
Одиниця в умові if приведеться до true
та виконається вивід значення в консоль.
*/

// ------------------------------------------------------------------

/*
Задача №2
За допомогою циклу FOR виведіть в консоль 10 рядків:
Пункт №1
Пункт №2
і т.д.
*/

// ==== Рішення задачі: ====

for (let i = 1; i <= 10; ++i) {
	console.log(`Пункт № ${i}`);
}

// ------------------------------------------------------------------

/*
Задача №3
Що потрапить в консоль ?
*/
if (2 * 20 <= 10 || 30 / 2 < 5 && 10 <= "10" || 20 === "20") {
	console.log('000');
}
/*
==== Відповідь: ====
В консоль виведеться рядок '000', якщо умова в if приведеться до true

Крок 1 - виконуються оператори множення та ділення:
40 <= 10 || 15 < 5 && 10 <= "10" || 20 === "20"

Крок 2 - виконуються оператори порівняння:
false || false && true || false

Крок 3 - виконуються логічні оператори:
false

Результат умови if це false,
тому в консоль нічого не буде виведено
*/

// ------------------------------------------------------------------

/*
Задача №4
Створіть функцію, яка повертає результат ділення числа a на число b з додаванням рядка "Результат ділення: "
Викличте функцію передаючі різні значення, у тому числі не передаючи зовсім.
Функція не має повертати NaN, Infinite або помилку 
*/

function divNums(a, b) {
	const div = `${a / b}`;

	if (div === "NaN") {
		return;
	} else if (div === "Infinity" || div === "-Infinity") {
		return;
	} else {
		return `Результат ділення: ${div}`;
	}
}

console.log(divNums(Infinity, 1));
console.log(divNums(-Infinity, 1));
console.log(divNums(60, 5));
console.log(divNums(10, 2));
console.log(divNums(2, 0));
console.log(divNums(0, 0));
console.log(divNums("5", "5"));

// ------------------------------------------------------------------

/*
Задача №5
Створіть масив даних - 5 елементів, один з яких число 10
Обробіть масив за допомогою методу перебору
Перевіряйте елемент на відповідність числу 10, та у разі відповідності, виводьте в консоль
*/

const someArray = [4, "Hello", true, 10, "World"];

someArray.forEach(element => {
	if (element === 10) {
		console.log(element);
	}
});